Autodesk.Revit.DB.TableCellCombinedParameterData.ParamId
The parameter id
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null

Autodesk.Revit.DB.TableCellCombinedParameterData.CategoryId
Category id for this parameter
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null

Autodesk.Revit.DB.TableCellCombinedParameterData.Separator
The separator for this parameter
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null

Autodesk.Revit.DB.TableCellCombinedParameterData.Suffix
The suffix for this parameter
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null

Autodesk.Revit.DB.TableCellCombinedParameterData.Prefix
The prefix for this parameter
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null

Autodesk.Revit.DB.TableCellCombinedParameterData.SampleValue
The sample/example value for the parameter in text form
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null